; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	instrument2 - instrument
	instrument3 - instrument
	satellite2 - satellite
	instrument4 - instrument
	instrument5 - instrument
	image3 - mode
	infrared1 - mode
	image2 - mode
	spectrograph0 - mode
	GroundStation1 - direction
	Star2 - direction
	Star3 - direction
	Star5 - direction
	Star7 - direction
	GroundStation10 - direction
	Star14 - direction
	GroundStation15 - direction
	Star25 - direction
	GroundStation11 - direction
	GroundStation26 - direction
	GroundStation22 - direction
	GroundStation19 - direction
	Star27 - direction
	GroundStation16 - direction
	Star17 - direction
	Star20 - direction
	GroundStation29 - direction
	GroundStation9 - direction
	GroundStation24 - direction
	Star28 - direction
	Star23 - direction
	Star18 - direction
	Star13 - direction
	GroundStation12 - direction
	Star0 - direction
	Star4 - direction
	Star8 - direction
	Star21 - direction
	Star6 - direction
	Phenomenon30 - direction
	Phenomenon31 - direction
	Star32 - direction
	Phenomenon33 - direction
	Star34 - direction
	Star35 - direction
	Planet36 - direction
	Planet37 - direction
	Planet38 - direction
	Phenomenon39 - direction
	Planet40 - direction
	Planet41 - direction
	Star42 - direction
	Star43 - direction
	Phenomenon44 - direction
	Phenomenon45 - direction
	Phenomenon46 - direction
	Planet47 - direction
	Star48 - direction
	Planet49 - direction
)
(:init
	(supports instrument0 infrared1)
	(supports instrument0 image2)
	(calibration_target instrument0 GroundStation12)
	(calibration_target instrument0 Star23)
	(calibration_target instrument0 GroundStation19)
	(calibration_target instrument0 Star17)
	(calibration_target instrument0 GroundStation29)
	(calibration_target instrument0 GroundStation22)
	(calibration_target instrument0 Star8)
	(calibration_target instrument0 GroundStation26)
	(calibration_target instrument0 GroundStation11)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation26)
	(supports instrument1 image3)
	(supports instrument1 image2)
	(supports instrument1 spectrograph0)
	(calibration_target instrument1 Star6)
	(calibration_target instrument1 GroundStation29)
	(calibration_target instrument1 Star20)
	(calibration_target instrument1 Star17)
	(calibration_target instrument1 GroundStation16)
	(calibration_target instrument1 Star18)
	(calibration_target instrument1 Star27)
	(calibration_target instrument1 Star8)
	(supports instrument2 spectrograph0)
	(calibration_target instrument2 Star23)
	(calibration_target instrument2 Star21)
	(calibration_target instrument2 Star28)
	(calibration_target instrument2 Star6)
	(calibration_target instrument2 GroundStation24)
	(calibration_target instrument2 GroundStation9)
	(calibration_target instrument2 Star8)
	(calibration_target instrument2 Star4)
	(calibration_target instrument2 Star13)
	(supports instrument3 image3)
	(supports instrument3 image2)
	(supports instrument3 infrared1)
	(calibration_target instrument3 Star18)
	(on_board instrument1 satellite1)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star4)
	(supports instrument4 infrared1)
	(calibration_target instrument4 GroundStation12)
	(calibration_target instrument4 Star13)
	(calibration_target instrument4 Star0)
	(supports instrument5 spectrograph0)
	(calibration_target instrument5 Star6)
	(calibration_target instrument5 Star21)
	(calibration_target instrument5 Star8)
	(calibration_target instrument5 Star4)
	(calibration_target instrument5 Star0)
	(on_board instrument4 satellite2)
	(on_board instrument5 satellite2)
	(power_avail satellite2)
	(pointing satellite2 GroundStation15)
)
(:goal (and
	(pointing satellite1 Planet36)
	(have_image Phenomenon30 image2)
	(have_image Phenomenon31 spectrograph0)
	(have_image Star32 image2)
	(have_image Phenomenon33 spectrograph0)
	(have_image Star34 image2)
	(have_image Star35 image3)
	(have_image Planet36 infrared1)
	(have_image Planet37 infrared1)
	(have_image Planet38 spectrograph0)
	(have_image Phenomenon39 image2)
	(have_image Planet40 spectrograph0)
	(have_image Planet41 image2)
	(have_image Star42 spectrograph0)
	(have_image Star43 infrared1)
	(have_image Phenomenon44 spectrograph0)
	(have_image Phenomenon45 infrared1)
	(have_image Phenomenon46 image2)
	(have_image Planet47 infrared1)
	(have_image Star48 image2)
	(have_image Planet49 image2)
))

)

; plan
1. (switch_on instrument3 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument3)
   goals met: 0 of 21
2. (switch_on instrument5 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument5)
   goals met: 0 of 21
3. (turn_to satellite2 phenomenon31 groundstation15)
   deleted: (pointing satellite2 groundstation15)
   added: (pointing satellite2 phenomenon31)
   goals met: 0 of 21
4. (turn_to satellite1 phenomenon30 star4)
   deleted: (pointing satellite1 star4)
   added: (pointing satellite1 phenomenon30)
   goals met: 0 of 21
5. (turn_to satellite2 star8 phenomenon31)
   deleted: (pointing satellite2 phenomenon31)
   added: (pointing satellite2 star8)
   goals met: 0 of 21
6. (calibrate satellite2 instrument5 star8)
   added: (calibrated instrument5)
   goals met: 0 of 21
7. (turn_to satellite2 phenomenon31 star8)
   deleted: (pointing satellite2 star8)
   added: (pointing satellite2 phenomenon31)
   goals met: 0 of 21
8. (take_image satellite2 phenomenon31 instrument5 spectrograph0)
   added: (have_image phenomenon31 spectrograph0)
   goals met: 1 of 21
9. (turn_to satellite2 phenomenon33 phenomenon31)
   deleted: (pointing satellite2 phenomenon31)
   added: (pointing satellite2 phenomenon33)
   goals met: 1 of 21
10. (take_image satellite2 phenomenon33 instrument5 spectrograph0)
   added: (have_image phenomenon33 spectrograph0)
   goals met: 2 of 21
11. (turn_to satellite2 phenomenon44 phenomenon33)
   deleted: (pointing satellite2 phenomenon33)
   added: (pointing satellite2 phenomenon44)
   goals met: 2 of 21
12. (take_image satellite2 phenomenon44 instrument5 spectrograph0)
   added: (have_image phenomenon44 spectrograph0)
   goals met: 3 of 21
13. (turn_to satellite2 planet38 phenomenon44)
   deleted: (pointing satellite2 phenomenon44)
   added: (pointing satellite2 planet38)
   goals met: 3 of 21
14. (take_image satellite2 planet38 instrument5 spectrograph0)
   added: (have_image planet38 spectrograph0)
   goals met: 4 of 21
15. (turn_to satellite2 planet40 planet38)
   deleted: (pointing satellite2 planet38)
   added: (pointing satellite2 planet40)
   goals met: 4 of 21
16. (take_image satellite2 planet40 instrument5 spectrograph0)
   added: (have_image planet40 spectrograph0)
   goals met: 5 of 21
17. (turn_to satellite2 star42 planet40)
   deleted: (pointing satellite2 planet40)
   added: (pointing satellite2 star42)
   goals met: 5 of 21
18. (take_image satellite2 star42 instrument5 spectrograph0)
   added: (have_image star42 spectrograph0)
   goals met: 6 of 21
19. (turn_to satellite1 star18 phenomenon30)
   deleted: (pointing satellite1 phenomenon30)
   added: (pointing satellite1 star18)
   goals met: 6 of 21
20. (calibrate satellite1 instrument3 star18)
   added: (calibrated instrument3)
   goals met: 6 of 21
21. (turn_to satellite1 phenomenon30 star18)
   deleted: (pointing satellite1 star18)
   added: (pointing satellite1 phenomenon30)
   goals met: 6 of 21
22. (take_image satellite1 phenomenon30 instrument3 image2)
   added: (have_image phenomenon30 image2)
   goals met: 7 of 21
23. (turn_to satellite1 phenomenon39 phenomenon30)
   deleted: (pointing satellite1 phenomenon30)
   added: (pointing satellite1 phenomenon39)
   goals met: 7 of 21
24. (take_image satellite1 phenomenon39 instrument3 image2)
   added: (have_image phenomenon39 image2)
   goals met: 8 of 21
25. (turn_to satellite1 phenomenon45 phenomenon39)
   deleted: (pointing satellite1 phenomenon39)
   added: (pointing satellite1 phenomenon45)
   goals met: 8 of 21
26. (take_image satellite1 phenomenon45 instrument3 infrared1)
   added: (have_image phenomenon45 infrared1)
   goals met: 9 of 21
27. (turn_to satellite1 phenomenon46 phenomenon45)
   deleted: (pointing satellite1 phenomenon45)
   added: (pointing satellite1 phenomenon46)
   goals met: 9 of 21
28. (take_image satellite1 phenomenon46 instrument3 image2)
   added: (have_image phenomenon46 image2)
   goals met: 10 of 21
29. (turn_to satellite1 planet36 phenomenon46)
   deleted: (pointing satellite1 phenomenon46)
   added: (pointing satellite1 planet36)
   goals met: 11 of 21
30. (take_image satellite1 planet36 instrument3 infrared1)
   added: (have_image planet36 infrared1)
   goals met: 12 of 21
31. (turn_to satellite1 planet37 planet36)
   deleted: (pointing satellite1 planet36)
   added: (pointing satellite1 planet37)
   goals met: 11 of 21
32. (take_image satellite1 planet37 instrument3 infrared1)
   added: (have_image planet37 infrared1)
   goals met: 12 of 21
33. (turn_to satellite1 planet36 planet37)
   deleted: (pointing satellite1 planet37)
   added: (pointing satellite1 planet36)
   goals met: 13 of 21
34. (turn_to satellite1 planet41 planet36)
   deleted: (pointing satellite1 planet36)
   added: (pointing satellite1 planet41)
   goals met: 12 of 21
35. (take_image satellite1 planet41 instrument3 image2)
   added: (have_image planet41 image2)
   goals met: 13 of 21
36. (turn_to satellite1 planet36 planet41)
   deleted: (pointing satellite1 planet41)
   added: (pointing satellite1 planet36)
   goals met: 14 of 21
37. (turn_to satellite1 planet47 planet36)
   deleted: (pointing satellite1 planet36)
   added: (pointing satellite1 planet47)
   goals met: 13 of 21
38. (take_image satellite1 planet47 instrument3 infrared1)
   added: (have_image planet47 infrared1)
   goals met: 14 of 21
39. (turn_to satellite1 planet36 planet47)
   deleted: (pointing satellite1 planet47)
   added: (pointing satellite1 planet36)
   goals met: 15 of 21
40. (turn_to satellite1 planet49 planet36)
   deleted: (pointing satellite1 planet36)
   added: (pointing satellite1 planet49)
   goals met: 14 of 21
41. (take_image satellite1 planet49 instrument3 image2)
   added: (have_image planet49 image2)
   goals met: 15 of 21
42. (turn_to satellite1 planet36 planet49)
   deleted: (pointing satellite1 planet49)
   added: (pointing satellite1 planet36)
   goals met: 16 of 21
43. (turn_to satellite1 star32 planet36)
   deleted: (pointing satellite1 planet36)
   added: (pointing satellite1 star32)
   goals met: 15 of 21
44. (take_image satellite1 star32 instrument3 image2)
   added: (have_image star32 image2)
   goals met: 16 of 21
45. (turn_to satellite1 planet36 star32)
   deleted: (pointing satellite1 star32)
   added: (pointing satellite1 planet36)
   goals met: 17 of 21
46. (turn_to satellite1 star34 planet36)
   deleted: (pointing satellite1 planet36)
   added: (pointing satellite1 star34)
   goals met: 16 of 21
47. (take_image satellite1 star34 instrument3 image2)
   added: (have_image star34 image2)
   goals met: 17 of 21
48. (turn_to satellite1 planet36 star34)
   deleted: (pointing satellite1 star34)
   added: (pointing satellite1 planet36)
   goals met: 18 of 21
49. (turn_to satellite1 star35 planet36)
   deleted: (pointing satellite1 planet36)
   added: (pointing satellite1 star35)
   goals met: 17 of 21
50. (take_image satellite1 star35 instrument3 image3)
   added: (have_image star35 image3)
   goals met: 18 of 21
51. (turn_to satellite1 planet36 star35)
   deleted: (pointing satellite1 star35)
   added: (pointing satellite1 planet36)
   goals met: 19 of 21
52. (turn_to satellite1 star43 planet36)
   deleted: (pointing satellite1 planet36)
   added: (pointing satellite1 star43)
   goals met: 18 of 21
53. (take_image satellite1 star43 instrument3 infrared1)
   added: (have_image star43 infrared1)
   goals met: 19 of 21
54. (turn_to satellite1 planet36 star43)
   deleted: (pointing satellite1 star43)
   added: (pointing satellite1 planet36)
   goals met: 20 of 21
55. (turn_to satellite1 star48 planet36)
   deleted: (pointing satellite1 planet36)
   added: (pointing satellite1 star48)
   goals met: 19 of 21
56. (take_image satellite1 star48 instrument3 image2)
   added: (have_image star48 image2)
   goals met: 20 of 21
57. (turn_to satellite1 planet36 star48)
   deleted: (pointing satellite1 star48)
   added: (pointing satellite1 planet36)
   goals met: 21 of 21
